## Estadistica Aplicada

Sesion 3 - 15 de agosto

Bárbara Govea Serna 1902869

Grupo 42

## Tuplas

Es una colección de objetos inmutable (no se puede agregar o quitar elementos)

In [364]:
# Las listas son con [], las tuplas con ()
tupla_alumno = ('Barbara','Govea',21)
type(tupla_alumno)

# No podemos utilizar las funciones para modificar la tupla

tuple

## DICCIONARIO

Es un par clave(variable) - valor

In [365]:
dic_grupo = {'Nombre':['Xime','Raul','Ana'], 'Edad':[17,21,15]}

In [366]:
dic_grupo['Nombre']

['Xime', 'Raul', 'Ana']

In [367]:
dic_grupo.keys()

dict_keys(['Nombre', 'Edad'])

In [368]:
dic_grupo.values()

dict_values([['Xime', 'Raul', 'Ana'], [17, 21, 15]])

In [369]:
type(dic_grupo)

dict

## PANDAS

Esta constituida sobre Numpy, asi que todo lo que se puede hacer en numpy se puede aplicar en PANDAS

Ofrece 3 tipos distintos de estructuras de datos que permiten almacenar y manipular datos de una manera fácil y eficiente:

- Series: Estructura unidimensional, una variable con solo una etiqueta
- Dataframe: Estructura bidimensional, osea filas y columnas
- Panel: Datos en 3 dimensiones, es decir, multidimensionales estructurados en observaciones en el tiempo.

Estas estructuras estan basadas en arrays de la libreria NumPy

In [370]:
# Ya esta instalada, la vamos a llamar y renombrar
import pandas as pd

## SERIES

1 sola variable

Suponemos que conocemos la edad de Pedro 12, Juan 17, Jime 21, Rosa 22

In [371]:
# Creamos una lista
edades = [12,17,21,22]

In [372]:
edades

[12, 17, 21, 22]

In [373]:
# Vamos a trabajar con las series, estructura unidimensional, definimos el nombre de las filas
serie_edades = pd.Series(edades, index=['Pedro','Juan','Jime','Rosa'])

In [374]:
type(serie_edades)

pandas.core.series.Series

In [375]:
serie_edades

Pedro    12
Juan     17
Jime     21
Rosa     22
dtype: int64

In [376]:
# Calculamos el promedio 
serie_edades.mean()

18.0

In [377]:
# Calculamos la mediana
serie_edades.median()

19.0

## DATAFRAME

Estructura bidimensional, osea filas y columnas

In [378]:
# Tenemos 4 listas
alumno1 = ['Juan', 'Perez', 23]
alumno2 = ['Raul', 'Gonzalez', 17]
alumno3 = ['Jimena', 'Rosas', 20]
alumno4 = ['Alejandra', 'Saldaña', 21]

In [379]:
# Hacemos 1 lista con las 4 listas
clase_estadistica = [alumno1,alumno2,alumno3,alumno4]

In [380]:
clase_estadistica

[['Juan', 'Perez', 23],
 ['Raul', 'Gonzalez', 17],
 ['Jimena', 'Rosas', 20],
 ['Alejandra', 'Saldaña', 21]]

In [381]:
# Convertimos nuestra lista en un dataframe, en un arreglo bidiomensional, donde tenemos filas y columnas y estas las defineremos
df_clase = pd.DataFrame(clase_estadistica, columns=['Nombre','Apellido','Edad'])

In [382]:
type(df_clase)

pandas.core.frame.DataFrame

In [383]:
df_clase

      Nombre  Apellido  Edad
0       Juan     Perez    23
1       Raul  Gonzalez    17
2     Jimena     Rosas    20
3  Alejandra   Saldaña    21

In [384]:
df_clase.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [385]:
df_clase.index

RangeIndex(start=0, stop=4, step=1)

In [386]:
# Agregaremos una column con el municipio en el q vive cada persona
df_clase['Municipio'] = ['Mty','Escobedo','Apodaca','Santiago']
print(df_clase)

      Nombre  Apellido  Edad Municipio
0       Juan     Perez    23       Mty
1       Raul  Gonzalez    17  Escobedo
2     Jimena     Rosas    20   Apodaca
3  Alejandra   Saldaña    21  Santiago

In [387]:
# Agregaremos una column de la edad en días
df_clase['Edad en dias'] = df_clase['Edad'] * 365
print(df_clase)

      Nombre  Apellido  Edad Municipio  Edad en dias
0       Juan     Perez    23       Mty          8395
1       Raul  Gonzalez    17  Escobedo          6205
2     Jimena     Rosas    20   Apodaca          7300
3  Alejandra   Saldaña    21  Santiago          7665

## Slicing: Seleccionar elementos de un DataFrame
1. Seleccion estandar 
2. Seleccion por posicion en el dataframe .iloc
3. Seleccion por etiqueta (nombre fila/columna).loc
4. Selección condicional

## 1. Selección estandar

In [388]:
# 1. Selección estandar, ponemos dentro el nombre de la columna
df_clase['Edad']

0    23
1    17
2    20
3    21
Name: Edad, dtype: int64

In [389]:
# Seleccion estandar de multiples columnas
df_clase[['Nombre','Edad']]

      Nombre  Edad
0       Juan    23
1       Raul    17
2     Jimena    20
3  Alejandra    21

In [390]:
# Seleccion estandar de filas
df_clase[0:2] #Solo la 0 y la 1 nos mostrara

  Nombre  Apellido  Edad Municipio  Edad en dias
0   Juan     Perez    23       Mty          8395
1   Raul  Gonzalez    17  Escobedo          6205

In [391]:
# Seleccion estandar de Filas y Columnas
df_clase[0:2]['Edad']

0    23
1    17
Name: Edad, dtype: int64

## 2. Selección por posicón: i.loc
dataframe.iloc[filas,columnas]

In [392]:
df_clase.iloc[0,2]

23

In [393]:
df_clase.iloc[0:2,2]

0    23
1    17
Name: Edad, dtype: int64

In [394]:
# Queremos ver todas las filas y la columna 1 y 2
df_clase.iloc[:,[1,2]]

   Apellido  Edad
0     Perez    23
1  Gonzalez    17
2     Rosas    20
3   Saldaña    21

In [395]:
df_clase

      Nombre  Apellido  Edad Municipio  Edad en dias
0       Juan     Perez    23       Mty          8395
1       Raul  Gonzalez    17  Escobedo          6205
2     Jimena     Rosas    20   Apodaca          7300
3  Alejandra   Saldaña    21  Santiago          7665

In [396]:
# Para cambiar el INDEX, queremos que el nombre sea el indice principal
df_clase = df_clase.set_index('Nombre')

In [397]:
df_clase

           Apellido  Edad Municipio  Edad en dias
Nombre
Juan          Perez    23       Mty          8395
Raul       Gonzalez    17  Escobedo          6205
Jimena        Rosas    20   Apodaca          7300
Alejandra   Saldaña    21  Santiago          7665

In [398]:
df_clase.index

Index(['Juan', 'Raul', 'Jimena', 'Alejandra'], dtype='object', name='Nombre')

## 3. Seleccion por etiqueta/nombre: .loc
dataframe.loc[nombre filas,nombre columnas]

In [399]:
# El : era para todas las filas
df_clase.loc[:,'Edad']

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [400]:
df_clase.loc['Juan','Edad']

23

In [401]:
## Selección por SQL
df_clase.Edad

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

## 4. Selección por condicionales o por el metodo

Similar a SQL, no es recomendable utilizarla

In [402]:
df_clase

           Apellido  Edad Municipio  Edad en dias
Nombre
Juan          Perez    23       Mty          8395
Raul       Gonzalez    17  Escobedo          6205
Jimena        Rosas    20   Apodaca          7300
Alejandra   Saldaña    21  Santiago          7665

In [403]:
df_clase[df_clase['Edad']>=18]

          Apellido  Edad Municipio  Edad en dias
Nombre
Juan         Perez    23       Mty          8395
Jimena       Rosas    20   Apodaca          7300
Alejandra  Saldaña    21  Santiago          7665

In [404]:
df_clase[df_clase['Municipio']=='Apodaca']

       Apellido  Edad Municipio  Edad en dias
Nombre
Jimena    Rosas    20   Apodaca          7300

## ORDENAMIENTO

In [405]:
#  Ordena los elementos numericos de  menor a mayor
df_clase.sort_values('Edad')

           Apellido  Edad Municipio  Edad en dias
Nombre
Raul       Gonzalez    17  Escobedo          6205
Jimena        Rosas    20   Apodaca          7300
Alejandra   Saldaña    21  Santiago          7665
Juan          Perez    23       Mty          8395

In [406]:
#  Ordena los elementos numericos de  mayor a menor
df_clase.sort_values('Edad',ascending=False)

           Apellido  Edad Municipio  Edad en dias
Nombre
Juan          Perez    23       Mty          8395
Alejandra   Saldaña    21  Santiago          7665
Jimena        Rosas    20   Apodaca          7300
Raul       Gonzalez    17  Escobedo          6205

In [407]:
df_clase.sort_values(['Edad','Apellido'])

           Apellido  Edad Municipio  Edad en dias
Nombre
Raul       Gonzalez    17  Escobedo          6205
Jimena        Rosas    20   Apodaca          7300
Alejandra   Saldaña    21  Santiago          7665
Juan          Perez    23       Mty          8395

## Funciones de NUMPY

In [408]:
# Media muestral
df_clase['Edad'].mean()

20.25

In [409]:
# Desviacion estacion muestral
df_clase['Edad'].std(ddof=1)

2.5

In [410]:
# Suma de edades
df_clase['Edad'].sum()

81

In [411]:
# Llamaremos a Numpy
import numpy as np

### np.where(condicion, valor si condicion, valor si condicion no se cumple)

SI EN EXCEL

In [412]:
# np.where (condicion, valor si condicion, valor si condicion no se cumple)
# Haremos una clasificacion, creando una nueva columna donde si la persona es mayor a edad se pondra "Mayor", sino "Menor"

df_clase['Mayoria_edad'] = np.where(df_clase['Edad']>=18,'Mayor','Menor')

In [413]:
df_clase

           Apellido  Edad Municipio  Edad en dias Mayoria_edad
Nombre
Juan          Perez    23       Mty          8395        Mayor
Raul       Gonzalez    17  Escobedo          6205        Menor
Jimena        Rosas    20   Apodaca          7300        Mayor
Alejandra   Saldaña    21  Santiago          7665        Mayor

### np.select(condiciones, valor condicion, valor si ninguna cond se cumple)

SI ANIDADO EN EXCEL

In [414]:
# np.select (condiciones, valor condicion, valor si ninguna cond se cumple)
condiciones = [df_clase['Edad']<=17, df_clase['Edad']<23, df_clase['Edad']>=23]

valores = ['Prepa','Universidad','Trabajando']

df_clase['Situación'] = np.select(condiciones,valores,default='Inválido')

print(df_clase)

           Apellido  Edad Municipio  Edad en dias Mayoria_edad    Situación
Nombre
Juan          Perez    23       Mty          8395        Mayor   Trabajando
Raul       Gonzalez    17  Escobedo          6205        Menor        Prepa
Jimena        Rosas    20   Apodaca          7300        Mayor  Universidad
Alejandra   Saldaña    21  Santiago          7665        Mayor  Universidad

In [415]:
df_clase.count()

Apellido        4
Edad            4
Municipio       4
Edad en dias    4
Mayoria_edad    4
Situación       4
dtype: int64

In [416]:
df_clase['Edad'].count()

4

In [417]:
df_clase.value_counts('Mayoria_edad')

Mayoria_edad
Mayor    3
Menor    1
Name: count, dtype: int64

In [418]:
# Pedimos que agrupe por mayoria de edad
# Pedimos que obtenga la media
# Pedimos que redondee a 1 decimal 
# Al final especificamos que queremos que haga los calculos de Edad
df_clase.groupby('Mayoria_edad').mean(numeric_only=True).round(1)['Edad']

Mayoria_edad
Mayor    21.3
Menor    17.0
Name: Edad, dtype: float64

In [419]:
## Aggregate agg
df_clase.agg('count')

Apellido        4
Edad            4
Municipio       4
Edad en dias    4
Mayoria_edad    4
Situación       4
dtype: int64

In [420]:
# Indicamos que agrupe por Mayoria_edad
# Indicamos la variable Edad, de la que queremos los calculos
# Agregamos que queremos la media y la desviacion estandar 
# Redondeamos a un decimal
df_clase.groupby('Mayoria_edad')['Edad'].agg(['mean','std']).round()

              mean  std
Mayoria_edad
Mayor         21.0  2.0
Menor         17.0  NaN

In [421]:
# Leemos un documento desde la nube
calificaciones = pd.read_csv('https://raw.githubusercontent.com/jimmyzac/Estadistica-Aplicada-FCFM-UANL/main/bases_datos/Calificaciones.csv')

In [422]:
# Nos mostrara las primeras 5, si queremos otro numero lo ponemos entre parentesis
calificaciones.head()

   Id   Nombre   Apellido  Calficación Final
0   1  ANTONIO     GARCIA                 73
1   2   MANUEL  FERNANDEZ                 19
2   3     JOSE   GONZALEZ                 38
3   4    DAVID      PEREZ                 14
4   5     JUAN      LOPEZ                 99

In [423]:
# Si queremos ver las ultimas 5, si no ponemos otro lo ponemos en ()
calificaciones.tail()

    Id       Nombre   Apellido  Calficación Final
23  24         LUIS  DOMINGUEZ                 12
24  25      ALBERTO      ORTIZ                 99
25  26  JUAN CARLOS     IBAÑEZ                 43
26  27       ALVARO    RAMIREZ                 40
27  28       ADRIAN       SAEZ                  7

In [424]:
calificaciones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Id                 28 non-null     int64
 1   Nombre             28 non-null     object
 2   Apellido           28 non-null     object
 3   Calficación Final  28 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.0+ KB

In [425]:
# Nos muestra filas x columnas
calificaciones.shape

(28, 4)

In [426]:
# Nos muestra las estadisticas descriptivas
calificaciones.describe()

              Id  Calficación Final
count  28.000000          28.000000
mean   14.500000          52.000000
std     8.225975          34.113102
min     1.000000           1.000000
25%     7.750000          18.500000
50%    14.500000          48.500000
75%    21.250000          85.250000
max    28.000000         100.000000

In [427]:
# Reenombraremos la columna 3, con ayuda de la funcion rename
calificaciones = calificaciones.rename(columns={'Calficación Final' : 'Cal.Final'})
calificaciones.head()

   Id   Nombre   Apellido  Cal.Final
0   1  ANTONIO     GARCIA         73
1   2   MANUEL  FERNANDEZ         19
2   3     JOSE   GONZALEZ         38
3   4    DAVID      PEREZ         14
4   5     JUAN      LOPEZ         99

In [428]:
# Vamos a eliminar la columna ID, con .loc lo haremos
calificaciones = calificaciones.loc[:, calificaciones.columns!='Id']
calificaciones.head()

    Nombre   Apellido  Cal.Final
0  ANTONIO     GARCIA         73
1   MANUEL  FERNANDEZ         19
2     JOSE   GONZALEZ         38
3    DAVID      PEREZ         14
4     JUAN      LOPEZ         99

In [429]:
# Agregamos una nueva columna, que se le asigne un si
calificaciones['Situación'] = np.where(calificaciones['Cal.Final']>=70,'Aprobado','Reprobado')
# Primero pedimos que agrupe por situacion, después que tomando la columna de Calif Final, haga el conteo
calificaciones.groupby('Situación')['Cal.Final'].count()

Situación
Aprobado     10
Reprobado    18
Name: Cal.Final, dtype: int64